<template>
  <section
    id="feedback"
    class="feedback">
    <div class="container">
      <div class="content">
          <feedback-card
            :feedbacks-number="feedbacks.length"
            :feedback-info="feedbacks[index]"
            @onLeft="index--"
            @onRight="index++"
          />
      </div>
    </div>
  </section>
</template>

<script>
import FeedbackCard from "@/components/cards/FeedbackCard.vue";
export default {
  name: "FeedBackBlock",
  components: {
    FeedbackCard,
  },
  data () {
    return {
      index: 0,
      feedbacks: [
        {
          id: 0,
          name: 'Юлія Федоруца',
          profession: 'Ведуча івентів',
          social: {
            link: 'https://www.instagram.com/julia_fedorutsa/',
            name: '@julia_fedorutsa',
            follow: '7.5K',
          },
          quote: 'З усіма завданнями впоралася на 200%!',
          text: ' Я — ведуча і моєю основною проблемою були брак\n' +
            'часу на зйомку якісного контенту під час івентів.\n' +
            'Запросила Таню до співпраці після того, як помітила\n' +
            'її роботу в Барон ТікТок Хауз. Я дуже задоволена її\n' +
            'роботою та відповідальністю. Таня ініціативна,\n' +
            'креативно підходить до моїх прохань\n' +
            'і з усіма завданнями впоралася на 200%! Також хочу\n' +
            'окремо відмітити її комунікативні навички, без яких\n' +
            'її робота з гостями івентів не мала б успіху! У ній чудово\n' +
            'поєднані творчість та відповідальність! Чесно кажучи,\n' +
            'не уявляю, ким маю замінити Тетяну у своїй команді.\n' +
            'Вона задала дуже хорошу високу планку. Щиро\n' +
            'рекомендую до співпраці!',
        },
        {
          id: 1,
          social: {
            link: 'https://www.instagram.com/lena_paskar/',
            name: '@lena_paskar',
            follow: '26.4K',
          },
          name: 'Лєна Паскар',
          profession: 'Ведуча івентів',
          quote: 'Якість сторінки суттєво змінилась у кращу сторону',
          text: 'За час співпраці з тобою - якість сторінки суттєво змінилась у кращу сторону.' +
            ' Фото, відео завжди актуальні та різноманітні , все вчасно та без затримок.' +
            ' Дякую за круту співпрацю і друге дихання моєї сторінки',
        },
        {
          id: 2,
          social: {
            link: 'https://www.instagram.com/dendulyak/',
            name: '@dendulyak',
            follow: '26.4K',
          },
          name: 'Денис Дуляк',
          profession: 'Фотограф',
          quote: 'Cтворювала миттєві відео, які оживляли мій контент',
          text: 'Таня неаби як допомагала не лише із контентом для моєї дружини, а й мене виручала.' +
            ' Адже на зйомках взагалі не вистачає часу для бекстейджу, або ж щоб зробити й собі кілька знімків для профілю.\n' +
            'Вона створювала мені миттєві відео зі зйомок, які оживляли мій контент.\n',
        },
        {
          id: 3,
          social: {
            link: 'https://www.instagram.com/irinadulyak/',
            name: '@irinadulyak',
            follow: '26.4K',
          },
          name: 'Ірина Дуляк ',
          quote: 'Мислити шаблонно - це не про Таню',
          profession: 'власниця агенції свят, блогер',
          text: 'Креатив та винахідливість - ось які слова першими спадають на думку, ' +
            'коли згадую про нашу з нею співпрацю. ' +
            'В процесі ми стали не просто колегами, а справжніми подугами!',
        },
        {
          id: 4,
          social: {
            link: 'https://www.instagram.com/dmitro_lubik/',
            name: '@dmitro_lubik',
            follow: '22.6K',
          },
          name: 'Дмитро Лубик',
          profession: 'ведучий свят',
          quote: 'Схоплює усе на льоту',
          text: 'Тетяна дуже комунікабельна та щира. Легка у роботі. Ми були з нею на одній хвилі. ' +
            'Завжди підкине нову та свіжу ідейку. Досить кмітлива, їй не доводилося довго щось пояснювати. ' +
            'Схоплює усе на льоту.',
        },
        {
          id: 5,
          social: {
            link: 'https://www.instagram.com/galinandriy/',
            name: '@galinandriy',
            follow: '241K',
          },
          name: 'Андрій Галин',
          profession: 'Блогер',
          quote: 'Бачу в ній неабиякий потенціал',
          text: 'Таня допомагала мені у генерації ідей для контенту.' +
            ' Знімали разом з нею відео для тік току та інстаграм.' +
            ' З нею працюється легко, весело, а головне продуктивно. ' +
            'Максимально включається в роботу та віддається їй. Бачу в ній неабиякий потенціал. Вона молодець!',
        },
        {
          id: 6,
          social: {
            link: 'https://www.instagram.com/vaniavelychko/',
            name: '@vaniavelychko',
            follow: '111K',
          },
          name: 'Ваня Величко',
          profession: 'ведучий свят, танцівник, блогер',
          quote: 'Компанійська, має комунікативні здібності, парядна',
          text: '+ Тетяна чітко розуміє поставленні перед собою завдання і виконує їх, іноді проявляє корисну ініціативу. ' +
            'Компанійська, має комунікативні здібності, парядна.' + '<br>' +
            '⁃ Якщо робота проходить на аутсорсі, може довго відповідати на повідомлення.',
        },
      ],
    }
  },
}
</script>

<style lang="scss" scoped>
.feedback {
  padding: 200px 0;
}

</style>